Catalogs/Инструменты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Инструменты</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ISIN</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИнструмента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаНоминала</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерЛота</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>FIGI</Name>
					<Comment>Financial Instrument Global Identifier</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>classCode</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Инструменты/Ext/ManagerModule.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьИнструментПоУИД(UID) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Инструменты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Инструменты КАК Инструменты
		|ГДЕ
		|	Инструменты.UID = &UID
		|	И не Инструменты.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("UID", UID);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		НовыйИнструмент = СоздатьИнструмент(UID);
		Возврат НовыйИнструмент;
	КонецЕсли;

КонецФункции // ПолучитьИнструментПоУИД()

Функция СоздатьИнструмент(UID)
	
	Отказ = Ложь;
	Данные = ms_РаботаСREST.TInvest_ОсновнаяИнформацияОбИнструменте(UID, , "INSTRUMENT_ID_TYPE_UID");
	
	Если ЗначениеЗаполнено(Данные) И Данные.Свойство("instrument") Тогда
		ИнструментОбъект = Справочники.Инструменты.СоздатьЭлемент();
		ДанныеИнструмента = Данные.instrument;
		ЗаполнитьЗначенияСвойств(ИнструментОбъект, ДанныеИнструмента);
		ИнструментОбъект.РазмерЛота = ДанныеИнструмента.lot;
		ИнструментОбъект.Наименование = ДанныеИнструмента.name;
		ИнструментОбъект.ВалютаНоминала = Справочники.Валюты.НайтиПоНаименованию(ДанныеИнструмента.currency);
		Если Не ЗначениеЗаполнено(ИнструментОбъект.ВалютаНоминала) И ЗначениеЗаполнено(ДанныеИнструмента.currency) Тогда
			ОбщегоНазначения.СообщитьПользователю("Не найдена валюта " + ДанныеИнструмента.currency,,,, Отказ);
		КонецЕсли;
		//Если ДанныеИнструмента.instrumentType = "share" Тогда
		//	ИнструментОбъект.ТипИнструмента = Перечисления.ТипыИнструментов.Акция;
		//КонецЕсли;
		Если Не Отказ Тогда
			ИнструментОбъект.Записать();
			ОбщегоНазначения.СообщитьПользователю("Записан новый инструмент " + ИнструментОбъект, ИнструментОбъект.Ссылка);
			
			Возврат ИнструментОбъект.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;

КонецФункции // СоздатьИнструмент()

	
#КонецОбласти

#Область ОбработчикиСобытий
  // Код процедур и функций
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
  // Код процедур и функций
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
  // Код процедур и функций
#КонецОбласти

#Область Инициализация

#КонецОбласти
